# Требуется вычислить, сколько раз встречается некоторое число X в массиве A[1..N]. 
# Пользователь в первой строке вводит натуральное число N – количество элементов в массиве. 
# В последующих строках записаны N целых чисел Ai. Последняя строка содержит число X.

# 5   1 2 3 4 5   3  -> 1

n = int(input('Введите число: '))
a = [i for i in range(1, n + 1)]
print(a)
x = int(input('Введите число для поиска: '))
count = 0
for i in range(len(a)):
    if x == a[i]: count +=1
print(count)

# c = a.count(x)
# print(c)